Revit 2027 API
BuiltInFailures.EditingFailures.CannotDeleteEditedElement Property
 Can't delete element that is being edited.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotDeleteEditedElement { get; }
Public Shared ReadOnly Property CannotDeleteEditedElement As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotDeleteEditedElement {
	FailureDefinitionId^ get ();
}
static member CannotDeleteEditedElement : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.EditingFailures Class
Autodesk.Revit.DB Namespace